#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<string.h>
int main()
{
	/*
		一、数组：一组相同数据类型元素的集合
		1.一维数组
		初始化数组个数时，需要常量表达式，而不能用变量。(C99支持变长数组，可以用变量，vs2019不支持)
	*/
	//int n = 8;
	//int arr[n];//不支持
	//int arr1[10] = { 1,2,3,4,5,6,7,8,9,10 };//完全初始化
	//int arr2[10] = { 1,2,3,4,5,6 };//不完全初始化，剩余元素默认为0
	//int arr3[] = { 1,2,3,4,5 };//根据初始化内容来确定个数--5

	//char ch1[7] = { 'h','e','l','l','o' };//未初始化的元素默认为\0	-- h e l l o \0 \0
	//char ch2[] = { 'h','e','l','l','o' };//h e l l o
	//char ch3[7] = "hello";//h e l l o \0 \0
	//char ch4[] = "hello";//h e l l o \0

	//printf("%s\n", ch1);
	//printf("%d\n", strlen(ch1));
	//printf("%s\n", ch2);//遇到\0才停止
	//printf("%d\n", strlen(ch2));//随机值，字符串长度与数字长度不一样

	//int arr[10] = { 0 };
	//int i = 0;
	//for (i = 0; i < 10; i++)
	//{
	//	printf("&arr[%d] = %p\n", i, &arr[i]);//打印地址%p，以十六进制打印
	//	//1.一维数组在内存中是连续存放的
	//	//2.随着数组下标的增长，地址是由低到高变化的
	//}

	//int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
	//int* p = arr;//数组名是首元素地址
	//for (int i = 0; i < 10; i++)
	//{
	//	printf("%d ", *p);
	//	p++;
	//}

	//2.二维数组
	//int arr[3][4];//创建3行4列的数组
	//int arr1[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
	//int arr2[3][4] = { 1,2,3,4,5,6,7 };//不完全初始化，剩余元素补0
	//int arr3[3][4] = { {1,2},{3,4},{5,6} };//按行初始化
	//int arr4[][4] = { {1,2},{3,4},{5,6} };//初始化可以省略行，但是不能省略列
	//for (int i = 0; i < 3; i++)
	//{
	//	for (int j = 0; j < 4; j++)
	//		printf("%d ", arr4[i][j]);//行列坐标都是从0开始
	//	printf("\n");
	//}

	//二维数组在内存中的存储
	//int arr4[][4] = { {1,2},{3,4},{5,6} };//初始化可以省略行，但是不能省略列
	//for (int i = 0; i < 3; i++)
	//{
	//	for (int j = 0; j < 4; j++)
	//		printf("&arr[%d][%d] = %p\n", i, j, &arr4[i][j]);//二维数组在内存中也是连续存放的：行内连续，行间也是连续的。
	//		//实际上二维数组也是放在一行的，因此需要知道一“行”多少个元素即列数，所以定义时不能省略列数。
	//	printf("\n");
	//}
	//int* p = arr4;
	////int* p = &arr4[0][0];
	//for (int i = 0; i < 12; i++)
	//{
	//	printf("%d ", *p);
	//	p++;
	//}

	//二维数组arr[3][4]数组名：arr		二维数组的第一行数组名：arr[0]		二维数组的第二行数组名：arr[1]		二维数组的第二行数组名：arr[2]

	//冒泡排序
	//int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
	//int length = sizeof(arr) / sizeof(arr[0]);
	//bubbleSort2(arr, length);

	//数组名是什么
	//是首元素地址，但是有两个例外：
	//1.sizeof(数组名)：数组名表示整个数组，计算的是整个数组的大小，单位是字节。
	//2.&数组名：数组名表示整个数组，取出的是整个数组的地址。
	//int arr[10] = { 0 };
	//printf("%p\n", &arr[0]);
	//printf("%p\n", arr);//数组名是首元素地址
	//printf("%p\n", arr + 1);//首元素地址+1，加的是是个元素的长度
	//printf("%p\n", &arr);//此处取出的是数组的地址，值和首元素的地址一样。
	//printf("%p\n", &arr + 1);//数组地址+1，加的是一个数组的长度。

	return 0;
}